#  Pandas

In [1]:
import pandas as pd

### Series

In [2]:
series1 = pd.Series([1,2,3])
series1

0    1
1    2
2    3
dtype: int64

In [9]:
import pandas as pd
s=pd.Series([1,2,3,4],index=['a','b','c','d'])
print(s.iloc[0:4])

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
import numpy as np
series1= pd.Series(np.array([13,4,2]))
series1

0    13
1     4
2     2
dtype: int32

In [4]:
type(series1)

pandas.core.series.Series

In [5]:
series2 = pd.Series([13,4,2],index=['S1','S2','S2'])
series2

S1    13
S2     4
S2     2
dtype: int64

Index

In [6]:
prices = [10.70, 10.86, 10.74, 10.71, 10.79]
shares = pd.Series(prices)
shares

0    10.70
1    10.86
2    10.74
3    10.71
4    10.79
dtype: float64

In [7]:
days = ['Mon', 'Tue', 'Wed', 'Thur', 'Fri']
shares = pd.Series(prices, index=days)
shares

Mon     10.70
Tue     10.86
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

In [8]:
# Examin Index
shares.index

Index(['Mon', 'Tue', 'Wed', 'Thur', 'Fri'], dtype='object')

In [9]:
shares.index[4]

'Fri'

In [10]:
shares.index[:4]

Index(['Mon', 'Tue', 'Wed', 'Thur'], dtype='object')

In [11]:
shares.index[-4:]

Index(['Tue', 'Wed', 'Thur', 'Fri'], dtype='object')

In [12]:
print(shares.index.name)

None

In [13]:
shares.index.name = 'weekdays'
shares

weekdays
Mon     10.70
Tue     10.86
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

In [14]:
shares.index[2] = 'Wednesday'

TypeError: Index does not support mutable operations

In [15]:
shares.index = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']
shares

Monday       10.70
Tuesday      10.86
Wednesday    10.74
Thursday     10.71
Friday       10.79
dtype: float64

### DataFrame

In [3]:
#Dataframe - 2D labelled array, row and col index, tabular, structured data

df=pd.DataFrame([[1,"Karthik"],[2,"Nikhil"],[3,"Anurabh"]])
df

   0        1
0  1  Karthik
1  2   Nikhil
2  3  Anurabh

In [17]:
type(df)

pandas.core.frame.DataFrame

DataFrame From List

In [4]:
df=pd.DataFrame(
    [[1,"Karthik"],[2,"Nikhil"],[3,"Anurabh"],[4,"Juhi"]],
    index=['a','b','c','d'],
    columns=["Roll No", "Name"] 
)
df

   Roll No     Name
a        1  Karthik
b        2   Nikhil
c        3  Anurabh
d        4     Juhi

Basic Function

In [5]:
df.count()

Roll No    4
Name       4
dtype: int64

In [6]:
# give you information on the height of your DataFrame.

len(df)

4

In [ ]:
df.dtypes

In [ ]:
df.shape

In [19]:
df.ndimWhich

2

In [20]:
# Returns the number of elements in the DataFrame.

df.size

8

In [21]:
#Returns the actual data in the DataFrame as an NDarray
print(df.values)
type(df.values)

[[1 'Karthik']
 [2 'Nikhil']
 [3 'Anurabh']
 [4 'Juhi']]

numpy.ndarray

DataFrame from Dict

In [7]:
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

# Create dictionary my_dict with three key:value pairs
my_dict = {'country': names, 'drives_right': dr, 'cars_per_cap': cpc}

# Build a DataFrame cars from my_dict
cars = pd.DataFrame(my_dict)

print(cars)

         country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45

In [ ]:
# Definition of row_labels
cars.index = ['US', 'AUS', 'JAP', 'IN', 'RU', 'MOR', 'EG']
cars

Read CSV File

In [ ]:
cars = pd.read_csv("dataset/cars.csv")
cars

In [22]:
cars = pd.read_csv("dataset/cars.csv", index_col=0)
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [ ]:
cars.head()

In [ ]:
cars.tail()

Hierarchical Indexing

In [ ]:
stocks = pd.read_csv('dataset/stocks.csv')
stocks

In [ ]:
stocks = stocks.set_index(['Symbol', 'Date'])
stocks

In [ ]:
stocks.index

In [ ]:
print(stocks.index.name)

In [ ]:
print(stocks.index.names)

In [23]:
# Sort Index

stocks = stocks.sort_index()
stocks

NameError: name 'stocks' is not defined

In [ ]:
stocks.loc['AAPL']

Dataset info and shape

In [25]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, US to EG
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cars_per_cap  7 non-null      int64
 1   country       7 non-null      object
 2   drives_right  7 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 175.0+ bytes

In [26]:
cars.axes

[Index(['US', 'AUS', 'JAP', 'IN', 'RU', 'MOR', 'EG'], dtype='object'),
 Index(['cars_per_cap', 'country', 'drives_right'], dtype='object')]

### Select Data

Columns

In [ ]:
cars

In [ ]:
cars['country']

In [24]:
type(cars['country'])

pandas.core.series.Series

In [ ]:
cars[['country', 'drives_right']]

In [ ]:
type(cars[['country']])

In [ ]:
cars[['country','drives_right']]

Row Access

In [ ]:
cars

In [27]:
cars[2:5]

     cars_per_cap country  drives_right
JAP           588   Japan         False
IN             18   India         False
RU            200  Russia          True

loc

In [28]:
# Row as pandas series

cars.loc['IN']

cars_per_cap       18
country         India
drives_right    False
Name: IN, dtype: object

In [29]:
cars.loc[['IN','US','EG']]

    cars_per_cap        country  drives_right
IN            18          India         False
US           809  United States          True
EG            45          Egypt          True

In [ ]:
# Rows & Columns
cars.loc[['IN','US','EG'],['country','drives_right']]

In [ ]:
cars.loc[:,['country','drives_right']]

In [ ]:
stocks = pd.read_csv('dataset/stocks.csv', index_col=['Symbol', 'Date']).sort_index()
stocks

In [ ]:
stocks.loc[('CSCO', '2016-10-04')]

In [ ]:
stocks.loc[('CSCO', '2016-10-04'), 'Volume']

In [ ]:
stocks.loc['AAPL']

In [ ]:
stocks.loc['CSCO':'MSFT']

In [ ]:
stocks.loc[(['AAPL', 'MSFT'], '2016-10-05'), :]

In [ ]:
stocks.loc[(['AAPL', 'MSFT'], '2016-10-05'), 'Close']

In [ ]:
stocks.loc[('CSCO', ['2016-10-03', '2016-10-05']), :]

In [ ]:
stocks.loc[(slice('CSCO','MSFT'), slice('2016-10-03', '2016-10-05')),:]

iloc

In [ ]:
cars

In [ ]:
cars.loc[['AUS']]

In [ ]:
cars.iloc[[1]]

In [ ]:
cars.iloc[[1,2,3]]

In [ ]:
cars.loc[['AUS','JAP','IN'],['country','drives_right']]

In [ ]:
cars.iloc[[1,2,3],[1,2]]

In [ ]:
cars.iloc[:4,:2]

Filtering

In [ ]:
import pandas as pd
pop = pd.read_csv('dataset/brics.csv', index_col=0)
pop

In [ ]:
pop['area']
# pop.loc[:, 'area']
# pop.iloc[:,2]

In [ ]:
exp = pop['area'] > 8 
exp

In [ ]:
pop['area'] < 13

In [ ]:
pop[ exp ]

In [ ]:
import numpy as np
exp = np.logical_and(pop["area"] > 8, pop["area"] < 10)
exp

In [ ]:
pop[ np.logical_and(pop["area"] > 8, pop["area"] < 10) ]

Iteration

In [ ]:
cars = pd.read_csv("dataset/cars.csv", index_col=0)
cars

In [30]:
for val in cars:
    print(val)

cars_per_cap
country
drives_right

In [31]:
for lab, row in cars.iterrows():
    print(row['country'])

United States
Australia
Japan
India
Russia
Morocco
Egypt

In [ ]:
for lab, row in cars.iterrows():
    print(lab, "\t: ", row['country'])

In [33]:
for lab, row in cars.iterrows():
    cars.loc[lab, 'COUNTRY'] = row['country'].upper()

cars

     cars_per_cap        country  drives_right        COUNTRY
US            809  United States          True  UNITED STATES
AUS           731      Australia         False      AUSTRALIA
JAP           588          Japan         False          JAPAN
IN             18          India         False          INDIA
RU            200         Russia          True         RUSSIA
MOR            70        Morocco          True        MOROCCO
EG             45          Egypt          True          EGYPT

In [ ]:
# insted of for loop apply method can also be used to do the same.

cars = pd.read_csv("dataset/cars.csv", index_col=0)
cars

In [ ]:
cars['COUNTRY'] = cars['country'].apply(str.upper)
cars

### Reading data from file

Import form flat file

In [ ]:
file = 'dataset/titanic.csv'
df = pd.read_csv(file)
df.head()

In [ ]:
data = pd.read_csv(file, nrows=5, header=None)

# Build a numpy array from the DataFrame
data_array = data.values
print(data_array)

In [ ]:
print(type(data_array))

Import from excel file

In [ ]:
# you have to install openpyxl module
# open your terminal and type the following command

# pip install openpyxl

In [ ]:

file = 'dataset/battledeath.xlsx'

# Load spreadsheet
xl = pd.ExcelFile(file)

print(xl.sheet_names)

In [ ]:
df = xl.parse(1)

In [ ]:
df.head()

# Cleaning Data

Missing Value

In [11]:
import pandas as pd
import numpy as np

In [12]:
df = pd.DataFrame(
    np.random.randn(5, 3), 
    index=['a', 'c', 'e', 'f', 'h'],
    columns=['one', 'two', 'three'] )
df

        one       two     three
a  1.506504 -0.840953  0.193241
c  0.284416 -0.150962 -1.671907
e  1.785915 -0.041576  0.190118
f  0.483302  1.386209 -1.309612
h  1.651700  0.694403 -0.051593

In [13]:
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

        one       two     three
a  1.506504 -0.840953  0.193241
b       NaN       NaN       NaN
c  0.284416 -0.150962 -1.671907
d       NaN       NaN       NaN
e  1.785915 -0.041576  0.190118
f  0.483302  1.386209 -1.309612
g       NaN       NaN       NaN
h  1.651700  0.694403 -0.051593

In [14]:
# Check for missing value: isnull()

print(df['one'].isnull())

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [15]:
# Check for missing value: notnull()

print(df['one'].notnull())

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [16]:
# sum the value in column: one

df.one.sum()

5.711836911279098

In [17]:
df

        one       two     three
a  1.506504 -0.840953  0.193241
b       NaN       NaN       NaN
c  0.284416 -0.150962 -1.671907
d       NaN       NaN       NaN
e  1.785915 -0.041576  0.190118
f  0.483302  1.386209 -1.309612
g       NaN       NaN       NaN
h  1.651700  0.694403 -0.051593

In [18]:
# Replaced NaN with '0'
print(df.fillna(0))

        one       two     three
a  1.506504 -0.840953  0.193241
b  0.000000  0.000000  0.000000
c  0.284416 -0.150962 -1.671907
d  0.000000  0.000000  0.000000
e  1.785915 -0.041576  0.190118
f  0.483302  1.386209 -1.309612
g  0.000000  0.000000  0.000000
h  1.651700  0.694403 -0.051593

In [19]:
# Fill NA Forward pad/ffill

print(df.fillna(method='ffill'))

        one       two     three
a  1.506504 -0.840953  0.193241
b  1.506504 -0.840953  0.193241
c  0.284416 -0.150962 -1.671907
d  0.284416 -0.150962 -1.671907
e  1.785915 -0.041576  0.190118
f  0.483302  1.386209 -1.309612
g  0.483302  1.386209 -1.309612
h  1.651700  0.694403 -0.051593

In [20]:
# Fill NA Backward backfill/bfill

print(df.fillna(method='bfill'))

        one       two     three
a  1.506504 -0.840953  0.193241
b  0.284416 -0.150962 -1.671907
c  0.284416 -0.150962 -1.671907
d  1.785915 -0.041576  0.190118
e  1.785915 -0.041576  0.190118
f  0.483302  1.386209 -1.309612
g  1.651700  0.694403 -0.051593
h  1.651700  0.694403 -0.051593

In [21]:
# Drop NaN rows

print(df.dropna())

        one       two     three
a  1.506504 -0.840953  0.193241
c  0.284416 -0.150962 -1.671907
e  1.785915 -0.041576  0.190118
f  0.483302  1.386209 -1.309612
h  1.651700  0.694403 -0.051593

In [22]:
df

        one       two     three
a  1.506504 -0.840953  0.193241
b       NaN       NaN       NaN
c  0.284416 -0.150962 -1.671907
d       NaN       NaN       NaN
e  1.785915 -0.041576  0.190118
f  0.483302  1.386209 -1.309612
g       NaN       NaN       NaN
h  1.651700  0.694403 -0.051593

In [23]:
# Drop NaN columns

print(df.dropna(axis=1))

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

In [24]:
df = pd.read_csv('dataset/literary_birth_rate.csv', sep=';')
df.head()

    Country  Continent  female literacy  fertility     population
0      Chine       ASI             90.5      1.769  1,324,655,000
1       Inde       ASI             50.8      2.682  1,139,964,932
2        USA       NAM             99.0      2.077    304,060,000
3  Indonésie       ASI             88.8      2.132    227,345,082
4     Brésil       LAT             90.2      1.827    191,971,506

In [25]:
df.tail()

                 Country  Continent  female literacy  fertility population
157               Vanuatu       OCE             79.5      3.883    233,866
158                 Samoa       OCE             98.5      3.852    178,869
159  Sao Tomé-et-Principe        AF             83.3      3.718    160,174
160                 Aruba       LAT             98.0      1.732    105,455
161                 Tonga       ASI             99.1      3.928    103,566

In [26]:
df.shape

(162, 5)

In [27]:
df.columns

Index(['Country ', 'Continent', 'female literacy', 'fertility', 'population'], dtype='object')

In [29]:
df = df.rename(columns={'Country ':'country',})
df.columns

Index(['country', 'Continent', 'female literacy', 'fertility', 'population'], dtype='object')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 162 entries, 0 to 161
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   country          162 non-null    object
 1   Continent        162 non-null    object
 2   female literacy  162 non-null    float64
 3   fertility        162 non-null    float64
 4   population       162 non-null    object
dtypes: float64(2), object(3)
memory usage: 6.5+ KB

In [31]:
print(df.describe())

       female literacy   fertility
count       162.000000  162.000000
mean         80.107407    2.878673
std          23.052415    1.427597
min          12.600000    0.966000
25%          66.425000    1.823250
50%          90.000000    2.367500
75%          98.500000    3.880250
max         100.000000    7.069000

In [32]:
df.Continent.value_counts(dropna=False)

AF     49
ASI    47
EUR    36
LAT    24
OCE     4
NAM     2
Name: Continent, dtype: int64

In [33]:
df.country.value_counts(dropna=False).head()

Chine           1
Lituanie        1
Finland         1
Kirghizistan    1
Turkménistan    1
Name: country, dtype: int64

In [34]:
df.fertility.value_counts(dropna=False).head()

3.371    2
1.841    2
1.393    2
1.854    2
1.436    2
Name: fertility, dtype: int64

Melting

In [ ]:
airquality = pd.read_csv('dataset/airquality.csv')

# Print the head of airquality
print(airquality.head())

In [ ]:
# Melt airquality
airquality_melt = pd.melt(frame=airquality, id_vars=['Month', 'Day'])
print(airquality_melt.head())

In [ ]:
# Melt airquality
airquality_melt = pd.melt(
    frame=airquality, 
    id_vars=['Month', 'Day'], 
    var_name='measurement', 
    value_name='reading')
    
print(airquality_melt.head())

In [ ]:
# Pivot airquality_melt
airquality_pivot = airquality_melt.pivot_table(index=['Month', 'Day'], columns='measurement', values='reading')

print(airquality_pivot.head())

In [ ]:
# Reset the index of airquality_pivot
airquality_pivot = airquality_pivot.reset_index()

print(airquality_pivot.head())
print(airquality.head())

Split the column

In [ ]:
tb = pd.read_csv('dataset/tb.csv')
tb

In [ ]:
tb_melt = pd.melt(frame=tb, id_vars=['country', 'year'])
tb_melt

In [ ]:
# Create the 'gender' column
tb_melt['gender'] = tb_melt.variable.str[0]

# Create the 'age_group' column
tb_melt['age_group'] = tb_melt.variable.str[1:]

# Print the head of tb_melt
print(tb_melt.head())

In [ ]:
ebola = pd.read_csv('dataset/ebola.csv')
ebola

In [ ]:
ebola_melt = pd.melt(ebola, id_vars=['Date', 'Day'], var_name='type_country', value_name='counts')
ebola_melt

In [ ]:
# Create the 'str_split' column
ebola_melt['str_split'] = ebola_melt.type_country.str.split('_')
ebola_melt

In [ ]:
# Create the 'type' column
ebola_melt['type'] = ebola_melt.str_split.str.get(0)

# Create the 'country' column
ebola_melt['country'] = ebola_melt.str_split.str.get(1)

print(ebola_melt.head())

Concatenating

In [ ]:
uber1 = pd.read_csv('dataset/uber/uber1.csv')
uber2 = pd.read_csv('dataset/uber/uber2.csv')
uber3 = pd.read_csv('dataset/uber/uber3.csv')

In [ ]:
uber = pd.concat([uber1, uber2, uber3])
print(uber.shape)
print(uber.head())

In [ ]:
uber.loc[98,:]

In [ ]:
uber = pd.concat([uber1, uber2, uber3], ignore_index=True)
uber.loc[0,:]

In [ ]:
# Iterating and concatenating all file matches using glob method

import glob

In [ ]:
pattern = 'dataset/uber/*.csv'
csv_files = glob.glob(pattern)
csv_files

In [ ]:
df_list = []

for csv in csv_files:
    df = pd.read_csv(csv)
    df_list.append(df)

uber = pd.concat(df_list, ignore_index=True)

print(uber.shape)
print(uber.head())

Merging data

In [ ]:
import sqlite3

In [ ]:
connection = sqlite3.connect("dataset/survey.db")

# site dataframe
site = pd.read_sql_query("select name, lat, long from Site", connection)
print(site.head())

# visited dataframe dataframe
visited = pd.read_sql_query("select id, site, dated from Visited", connection)
print(visited.head())

survey = pd.read_sql_query("select * from Survey", connection)
print(survey.head())

In [ ]:
# 1-to-1 data merge

# Merge the DataFrames: o2o
o2o = pd.merge(left=site, right=visited, left_on='name', right_on='site')

print(o2o)

In [ ]:
# Mant-to-Many

m2o = pd.merge(left=site, right=visited, left_on='name', right_on='site')

# Merge m2m and survey: m2m
m2m = pd.merge(left=m2o, right=survey, left_on='id', right_on='taken')

# Print the first 20 lines of m2m
print(m2m.head(20))

Converting data types

In [ ]:
tips = pd.read_csv('dataset/tips.csv')

print(tips.head())

print("\n\n")
print(tips.info())

In [ ]:
# Convert the sex column to type 'category'
tips.sex = tips.sex.astype('category')

# Convert the smoker column to type 'category'
tips.smoker = tips.smoker.astype('category')

# Print the info of tips
print(tips.info())

Categorical data
- Converting categorical data to ‘category’ dtype:
- Can make the DataFrame smaller in memory
- Can make them be utilized by other Python libraries for analysis

In [ ]:
# Convert 'total_bill' to a numeric dtype
tips['total_bill'] = pd.to_numeric(tips['total_bill'], errors='coerce')

# Convert 'tip' to a numeric dtype
tips['tip'] = pd.to_numeric(tips['tip'], errors='coerce')

# Print the info of tips
print(tips.info())

Regular expressions

In [ ]:
import re

# Compile the pattern: prog
prog = re.compile('\d{3}-\d{3}-\d{4}')

# See if the pattern matches
result = prog.match('123-456-7890')
print(bool(result))

# See if the pattern matches
result = prog.match('1123-456-7890')
print(bool(result))

In [ ]:
# Find the numeric values: matches
matches = re.findall('\d+', 'the recipe calls for 10 strawberries and 1 banana')

# Print the matches
print(matches)

In [ ]:
# Write the second pattern
pattern2 = bool(re.match(pattern='^\$\d*\.\d{2}$', string='$123.45'))
print(pattern2)

In [ ]:
# Write the third pattern
pattern3 = bool(re.match(pattern='w*', string='India'))
print(pattern3)

Function

In [ ]:
tips = pd.read_csv('dataset/tips.csv')

def recode_sex(sex_value):
    if sex_value == 'Male':
        return 1   
    elif sex_value == 'Female':
        return 0  
    else:
        return np.nan

tips['sex_recode'] = tips.sex.apply(recode_sex)

tips.head()

In [ ]:
# # Write the lambda function using replace
# tips['total_dollar_replace'] = tips.total_dollar.apply(lambda x: x.replace('$', ''))

# # Write the lambda function using regular expressions
# tips['total_dollar_re'] = tips.total_dollar.apply(lambda x: re.findall('\d+\.\d+', x)[0])

# # Print the head of tips
# print(tips.head())

Dropping duplicate data

In [ ]:
billboard = pd.read_csv('dataset/billboard.csv')
billboard.head()

In [ ]:
tracks = billboard[['year','artist','track','time']]

# Print info of tracks
print(tracks.info())

In [ ]:
# Drop the duplicates
tracks_no_duplicates = tracks.drop_duplicates()

# Print info of tracks
print(tracks_no_duplicates.info())

Fill Missing Value

In [ ]:
airquality = pd.read_csv('dataset/airquality.csv')
airquality.info()

In [ ]:
# Calculate the mean of the Ozone column: oz_mean
oz_mean = airquality.Ozone.mean()

# Replace all the missing values in the Ozone column with the mean
airquality['Ozone'] = airquality.Ozone.fillna(oz_mean)

# Print the info of airquality
print(airquality.info())

### Groupby

In [1]:
import pandas as pd

In [2]:
sales = pd.DataFrame(
	{
	'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
	'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
	'bread': [139, 237, 326, 456],
	'butter': [20, 45, 70, 98]
	}
)

sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [3]:
sales['weekday'] == 'Sun'

0     True
1     True
2    False
3    False
Name: weekday, dtype: bool

In [4]:
sales.loc[sales['weekday'] == 'Sun'].count()

weekday    2
city       2
bread      2
butter     2
dtype: int64

In [5]:
# Split the data, apply the function and finally combine the result

sales.groupby('weekday').count()

         city  bread  butter
weekday
Mon         2      2       2
Sun         2      2       2

In [6]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [7]:
print(sales.groupby('weekday'))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001DE7A5A8F90>

In [8]:
sales.groupby('weekday').groups

{'Mon': [2, 3], 'Sun': [0, 1]}

In [9]:
sales_g = sales.groupby('city')
sales_g

In [10]:
print(sales_g.groups)
print(type(sales_g.groups))
print(sales_g.groups.keys())

{'Austin': [0, 2], 'Dallas': [1, 3]}
<class 'pandas.io.formats.printing.PrettyDict'>
dict_keys(['Austin', 'Dallas'])

In [11]:
# Groupby and Sum
sales.groupby('weekday')['bread'].sum()

weekday
Mon    782
Sun    376
Name: bread, dtype: int64

In [12]:
# Do the sum of multiple column

sales.groupby('weekday')[['bread','butter']].sum()

         bread  butter
weekday
Mon        782     168
Sun        376      65

In [15]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [14]:
print(sales.groupby(['city','weekday']).groups)

{('Austin', 'Mon'): [2], ('Austin', 'Sun'): [0], ('Dallas', 'Mon'): [3], ('Dallas', 'Sun'): [1]}

In [16]:
# multi-level index

sales.groupby(['city','weekday']).mean()

                bread  butter
city   weekday
Austin Mon      326.0    70.0
       Sun      139.0    20.0
Dallas Mon      456.0    98.0
       Sun      237.0    45.0

In [19]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [17]:
# Do groupby on Series

customers = pd.Series(['Dave','Alice','Bob','Alice'])
customers

0     Dave
1    Alice
2      Bob
3    Alice
dtype: object

In [18]:
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [20]:
sales.groupby(customers)['bread'].sum()

Alice    693
Bob      326
Dave     139
Name: bread, dtype: int64

Categorical data

In [21]:
sales['weekday'].unique()

array(['Sun', 'Mon'], dtype=object)

In [22]:
sales['weekday'] = sales['weekday'].astype('category')
sales['weekday']

0    Sun
1    Sun
2    Mon
3    Mon
Name: weekday, dtype: category
Categories (2, object): ['Mon', 'Sun']

Groupby and aggregation

In [23]:
sales.groupby('city')[['bread','butter']].max()

        bread  butter
city
Austin    326      70
Dallas    456      98

In [24]:
# Multiple aggregation
sales.groupby('city')[['bread','butter']].agg(['max','sum'])

       bread      butter
         max  sum    max  sum
city
Austin   326  465     70   90
Dallas   456  693     98  143

In [25]:
sales.groupby('weekday')[['bread', 'butter']].agg(['max','min'])

        bread      butter
          max  min    max min
weekday
Mon       456  326     98  70
Sun       237  139     45  20

In [27]:
# Custom aggregation function

def range1(s):
    return s.max() - s.min()

In [28]:
sales.groupby('weekday')[['bread', 'butter']].agg(range1)

         bread  butter
weekday
Mon        130      28
Sun         98      25

In [29]:
sales.groupby(customers)[['bread', 'butter']].agg({'bread':'sum', 'butter':range1})

       bread  butter
Alice    693      53
Bob      326       0
Dave     139       0

Group By

In [30]:
titanic = pd.read_csv('dataset/titanic.csv')
titanic.head()

,passengerId,survived,pclass,sex,age,sibSp,parch,ticket,fare,cabin,embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
by_class = titanic.groupby('pclass')

In [33]:
by_class.groups

{1: [1, 3, 6, 11, 23, 27, 30, 31, 34, 35, 52, 54, 55, 61, 62, 64, 83, 88, 92, 96, 97, 102, 110, 118, 124, 136, 137, 139, 151, 155, 166, 168, 170, 174, 177, 185, 187, 194, 195, 209, 215, 218, 224, 230, 245, 248, 252, 256, 257, 258, 262, 263, 268, 269, 270, 273, 275, 284, 290, 291, 295, 297, 298, 299, 305, 306, 307, 309, 310, 311, 318, 319, 325, 329, 331, 332, 334, 336, 337, 339, 341, 351, 356, 366, 369, 370, 373, 375, 377, 380, 383, 390, 393, 412, 430, 434, 435, 438, 445, 447, ...], 2: [9, 15, 17, 20, 21, 33, 41, 43, 53, 56, 58, 66, 70, 72, 78, 84, 98, 99, 117, 120, 122, 123, 133, 134, 135, 144, 145, 148, 149, 150, 161, 178, 181, 183, 190, 191, 193, 199, 211, 213, 217, 219, 221, 226, 228, 232, 234, 236, 237, 238, 239, 242, 247, 249, 259, 265, 272, 277, 288, 292, 303, 308, 312, 314, 316, 317, 322, 323, 327, 340, 342, 343, 344, 345, 346, 357, 361, 385, 387, 389, 397, 398, 399, 405, 407, 413, 416, 417, 418, 426, 427, 432, 437, 439, 440, 443, 446, 450, 458, 463, ...], 3: [0, 2, 4, 5, 7, 8, 10, 12, 13, 14, 16, 18, 19, 22, 24, 25, 26, 28, 29, 32, 36, 37, 38, 39, 40, 42, 44, 45, 46, 47, 48, 49, 50, 51, 57, 59, 60, 63, 65, 67, 68, 69, 71, 73, 74, 75, 76, 77, 79, 80, 81, 82, 85, 86, 87, 89, 90, 91, 93, 94, 95, 100, 101, 103, 104, 105, 106, 107, 108, 109, 111, 112, 113, 114, 115, 116, 119, 121, 125, 126, 127, 128, 129, 130, 131, 132, 138, 140, 141, 142, 143, 146, 147, 152, 153, 154, 156, 157, 158, 159, ...]}

In [34]:
total_survived = by_class.survived.count()
total_survived

pclass
1    216
2    184
3    491
Name: survived, dtype: int64

In [35]:
multi_col = titanic.groupby(['embarked','pclass'])
multi_col.survived.count()

embarked  pclass
C         1          85
          2          17
          3          66
Q         1           2
          2           3
          3          72
S         1         127
          2         164
          3         353
Name: survived, dtype: int64

In [36]:
by_class_sub = by_class[['age','fare']]
agg = by_class_sub.agg(['max', 'median'])
agg

         age             fare
         max median       max   median
pclass
1       80.0   37.0  512.3292  60.2875
2       70.0   29.0   73.5000  14.2500
3       74.0   24.0   69.5500   8.0500

In [39]:

agg.loc[:, ('age','max')]

pclass
1    80.0
2    70.0
3    74.0
Name: (age, max), dtype: float64

In [40]:
agg.loc[:, ('fare','median')]

pclass
1    60.2875
2    14.2500
3     8.0500
Name: (fare, median), dtype: float64

In [41]:
agg.loc[:, [('age','max'),('fare','max')]]

         age      fare
         max       max
pclass
1       80.0  512.3292
2       70.0   73.5000
3       74.0   69.5500

In [42]:
gapminder = pd.read_csv('dataset/gapminder.csv', index_col=['Year','region','Country']).sort_index()
gapminder.head()

                                  fertility    life  population  \
Year region  Country
1964 America Antigua and Barbuda      4.250  63.775     58653.0
             Argentina                3.068  65.388  21966478.0
             Aruba                    4.059  67.113     57031.0
             Bahamas                  4.220  64.189    133709.0
             Barbados                 4.094  62.819    234455.0

                                  child_mortality      gdp
Year region  Country
1964 America Antigua and Barbuda            72.78   5008.0
             Argentina                      57.43   8227.0
             Aruba                            NaN   5505.0
             Bahamas                        48.56  18160.0
             Barbados                       64.70   5681.0

In [43]:
by_year_region = gapminder.groupby(['Year','region'])

In [44]:
def spread(series):
    return series.max() - series.min()

In [45]:
aggregator = {'population':'sum', 'child_mortality':'mean', 'gdp':spread}

In [48]:
aggregated = by_year_region.agg(aggregator)
aggregated

                                   population  child_mortality       gdp
Year region
1964 America                     4.621957e+08       113.950667   18314.0
     East Asia & Pacific         1.110668e+09       129.109130   66821.0
     Europe & Central Asia       6.988545e+08        61.585319   28734.0
     Middle East & North Africa  1.180955e+08       179.605263   38474.0
     South Asia                  6.250739e+08       256.922500     812.0
...                                       ...              ...       ...
2013 East Asia & Pacific         2.244209e+09        22.285714  134744.0
     Europe & Central Asia       8.968788e+08         9.831875   86418.0
     Middle East & North Africa  4.030504e+08        20.221500  128676.0
     South Asia                  1.701241e+09        46.287500   11469.0
     Sub-Saharan Africa          9.205996e+08        76.944490   32035.0

[300 rows x 3 columns]

In [49]:
# Read sales data

sales = pd.read_csv('dataset/sales-feb-2015.csv', index_col='Date', parse_dates=True)
sales

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10
2015-02-07 23:00:00  Acme Coporation  Hardware      1
2015-02-09 09:00:00        Streeplex   Service     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-19 11:00:00        Mediacore  Hardware     16
2015-02-19 16:00:00        Mediacore   Service     10
2015-02-21 05:00:00        Mediacore  Software      3
2015-02-21 20:30:00            Hooli  Hardware      3
2015-02-25 00:30:00          Initech   Service     10
2015-02-26 09:00:00        Streeplex   Service      4

In [50]:
# The strftime converts a datetime object containing current date and time 
# to different string formats. %a->Abbreviated weekday name.

sales.index.strftime('%a')

Index(['Mon', 'Mon', 'Tue', 'Wed', 'Wed', 'Thu', 'Thu', 'Sat', 'Mon', 'Mon',
       'Wed', 'Wed', 'Mon', 'Thu', 'Thu', 'Sat', 'Sat', 'Wed', 'Thu'],
      dtype='object', name='Date')

In [51]:
by_day = sales.groupby(sales.index.strftime('%a'))
units_sum = by_day['Units'].sum()
units_sum

Date
Mon    48
Sat     7
Thu    59
Tue    13
Wed    48
Name: Units, dtype: int64

In [52]:
# pip install scipy
from scipy.stats import zscore

In [53]:
# Detecting outliers with Z-Scores

gapminder = pd.read_csv('dataset/gapminder.csv', index_col=['Year']).sort_index()
gapminder.head()

,Country,fertility,life,population,child_mortality,gdp,region
Year,,,,,,,
1964,Afghanistan,7.671,33.639,10474903.0,339.70,1182.0,South Asia
1964,Montenegro,3.093,66.411,500745.0,73.53,8135.0,Europe & Central Asia
1964,Morocco,7.119,50.167,12959397.0,219.30,2040.0,Middle East & North Africa
1964,Mozambique,6.602,36.773,8296714.0,279.80,540.0,Sub-Saharan Africa
1964,Myanmar,6.130,45.949,22824142.0,227.78,1358.0,East Asia & Pacific

In [54]:
gapminder_2010 = gapminder.loc[2010]
gapminder_2010

,Country,fertility,life,population,child_mortality,gdp,region
Year,,,,,,,
2010,Czech Rep.,1.501,77.267,10492960.0,NaN,NaN,Europe & Central Asia
2010,Vietnam,1.820,75.490,87848445.0,24.80,4486.0,East Asia & Pacific
2010,Grenada,2.240,72.375,104487.0,13.20,11178.0,America
2010,Venezuela,2.472,74.159,28979857.0,16.60,16536.0,America
2010,French Polynesia,2.110,75.618,270764.0,8.64,NaN,East Asia & Pacific
...,...,...,...,...,...,...,...
2010,Bahrain,2.142,76.203,1261835.0,8.30,40553.0,Middle East & North Africa
2010,Sweden,1.987,81.426,9379687.0,3.10,42898.0,Europe & Central Asia
2010,Costa Rica,1.847,79.280,4658887.0,10.20,12322.0,America
2010,Uganda,6.155,57.319,33424683.0,79.50,1515.0,Sub-Saharan Africa
2010,Sri Lanka,2.343,73.790,20859949.0,10.60,7572.0,South Asia

In [55]:
# z-score value of +/- 3 is generally considered to be an outlier

standardized = gapminder_2010.groupby('region')[['life','fertility']].transform(zscore)
outliers = (standardized['life'] < -3) | (standardized['fertility'] > 3)

# Filter gapminder_2010 by the outliers
gm_outliers = gapminder_2010.loc[outliers]
gm_outliers

,Country,fertility,life,population,child_mortality,gdp,region
Year,,,,,,,
2010,Guatemala,3.974,71.100,14388929.0,34.5,6849.0,America
2010,Haiti,3.350,45.000,9993247.0,208.8,1518.0,America
2010,Tajikistan,3.780,66.830,6878637.0,52.6,2110.0,Europe & Central Asia
2010,Timor-Leste,6.237,65.952,1124355.0,63.8,1777.0,East Asia & Pacific

In [2]:
# You can use .groupby() and .transform() to fill missing data appropriately 
# for each group
import pandas as pd
titanic = pd.read_csv('dataset/titanic.csv')
titanic.tail(6)

,passengerId,survived,pclass,sex,age,sibSp,parch,ticket,fare,cabin,embarked
885,886,0,3,female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,male,32.0,0,0,370376,7.750,NaN,Q

In [3]:
# Create a groupby object from titanic dataframe
by_gen_class = titanic.groupby(['sex', 'pclass'])

In [4]:
# Write a function that imputes median
def impute_median(s):
    return s.fillna(s.median())

In [5]:
# Impute age and assign to titanic['age']
titanic.age = by_gen_class['age'].transform(impute_median)
titanic.tail(10)

,passengerId,survived,pclass,sex,age,sibSp,parch,ticket,fare,cabin,embarked
881,882,0,3,male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,female,21.5,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
# analyze survival rates from titanic dataset

def c_deck_survival(gr):
    c_passengers = gr['cabin'].str.startswith('C').fillna(False)
    return gr.loc[c_passengers, 'survived'].mean()

In [7]:
by_gen = titanic.groupby('sex')

In [8]:
# Call by_sex.apply with the function c_deck_survival and print the result
c_surv_by_gen = by_gen.apply(c_deck_survival)
c_surv_by_gen

sex
female    0.888889
male      0.343750
dtype: float64

In [2]:
import pandas as pd

In [3]:
# Grouping and filtering with .filter() method

sales = pd.read_csv('dataset/sales-feb-2015.csv', index_col='Date', parse_dates=True)
sales

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10
2015-02-07 23:00:00  Acme Coporation  Hardware      1
2015-02-09 09:00:00        Streeplex   Service     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-19 11:00:00        Mediacore  Hardware     16
2015-02-19 16:00:00        Mediacore   Service     10
2015-02-21 05:00:00        Mediacore  Software      3
2015-02-21 20:30:00            Hooli  Hardware      3
2015-02-25 00:30:00          Initech   Service     10
2015-02-26 09:00:00        Streeplex   Service      4

In [4]:
# Group sales by 'Company'
by_company = sales.groupby('Company')

In [7]:
by_company

In [6]:
by_com_sum = by_company['Units'].sum()
by_com_sum

Company
Acme Coporation    34
Hooli              30
Initech            30
Mediacore          45
Streeplex          36
Name: Units, dtype: int64

In [12]:
# Filter 'Units' where the sum is > 35
by_company.filter(lambda g:g['Units'].sum() > 35)

                       Company   Product  Units
Date
2015-02-02 21:00:00  Mediacore  Hardware      9
2015-02-04 15:30:00  Streeplex  Software     13
2015-02-09 09:00:00  Streeplex   Service     19
2015-02-09 13:00:00  Mediacore  Software      7
2015-02-19 11:00:00  Mediacore  Hardware     16
2015-02-19 16:00:00  Mediacore   Service     10
2015-02-21 05:00:00  Mediacore  Software      3
2015-02-26 09:00:00  Streeplex   Service      4

### Query pandas dataframe

In [24]:
import pandas as pd
import numpy as np

technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days', None,np.nan],
    'Discount':[1000,2300,1000,1200,2500]
          }
courses = pd.DataFrame(technologies)
courses

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   30days      1000
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [25]:
spark = courses.query("Courses == 'Spark'")
spark

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [26]:
# using variable

value = 'Python'
spark = courses.query("Courses == @value")
spark

  Courses    Fee Duration  Discount
3  Python  24000     None      1200

In [28]:
courses

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   30days      1000
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [29]:
print(courses.query("Courses == 'Spark'", inplace=True))

None

In [30]:
courses

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [31]:
technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days', None,np.nan],
    'Discount':[1000,2300,1000,1200,2500]
          }
courses = pd.DataFrame(technologies)
courses

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   30days      1000
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [32]:
print(courses.query("Courses != 'Spark'"))

   Courses    Fee Duration  Discount
1  PySpark  25000   50days      2300
2   Hadoop  23000   30days      1000
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [33]:
print(courses.query("Courses in ('Spark','PySpark')"))

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300

In [34]:
values=['Spark','PySpark']
print(courses.query("Courses in @values"))

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300

In [35]:
values=['Spark','PySpark']
print(courses.query("Courses not in @values"))

  Courses    Fee Duration  Discount
2  Hadoop  23000   30days      1000
3  Python  24000     None      1200
4  Pandas  26000      NaN      2500

In [36]:
# Query by multiple conditions

print(courses.query("Fee >= 23000 and Fee <= 24000"))

  Courses    Fee Duration  Discount
2  Hadoop  23000   30days      1000
3  Python  24000     None      1200

In [38]:
# By using lambda function

print(courses.apply(lambda row: row[courses['Courses'].isin(['Spark','PySpark'])]))

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300

In [39]:
# Other examples you can try to query rows
courses[courses["Courses"] == 'Spark']

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000

In [40]:
courses.loc[courses['Courses'] == value]

  Courses    Fee Duration  Discount
3  Python  24000     None      1200

In [41]:
courses.loc[courses['Courses'] != 'Spark']

   Courses    Fee Duration  Discount
1  PySpark  25000   50days      2300
2   Hadoop  23000   30days      1000
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [42]:
courses.loc[courses['Courses'].isin(values)]

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300

In [43]:
courses.loc[~courses['Courses'].isin(values)]

  Courses    Fee Duration  Discount
2  Hadoop  23000   30days      1000
3  Python  24000     None      1200
4  Pandas  26000      NaN      2500

In [44]:
courses.loc[(courses['Discount'] >= 1000) & (courses['Discount'] <= 2000)]

  Courses    Fee Duration  Discount
0   Spark  22000   30days      1000
2  Hadoop  23000   30days      1000
3  Python  24000     None      1200

In [45]:
courses.loc[(courses['Discount'] >= 1200) & (courses['Fee'] >= 23000 )]

   Courses    Fee Duration  Discount
1  PySpark  25000   50days      2300
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [46]:
# Select based on value contains
print(courses[courses['Courses'].str.contains("Spark")])

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300

In [47]:
# Select after converting values
print(courses[courses['Courses'].str.lower().str.contains("spark")])

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300

In [48]:
#Select startswith
print(courses[courses['Courses'].str.startswith("P")])

   Courses    Fee Duration  Discount
1  PySpark  25000   50days      2300
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

### datetime

In [49]:
pd.date_range('1/1/2011', periods=5)

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05'],
              dtype='datetime64[ns]', freq='D')

In [50]:
pd.date_range('1/1/2011', periods=5, freq='M')

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-30',
               '2011-05-31'],
              dtype='datetime64[ns]', freq='M')

In [51]:
from datetime import datetime
start = datetime(2011, 1, 1)
end = datetime(2011, 1, 5)

pd.date_range(start, end)

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05'],
              dtype='datetime64[ns]', freq='D')

### time series

In [52]:
sales = pd.read_csv('dataset/sales-feb-2015.csv', index_col='Date', parse_dates=True)
sales.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 19 entries, 2015-02-02 08:30:00 to 2015-02-26 09:00:00
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  19 non-null     object
 1   Product  19 non-null     object
 2   Units    19 non-null     int64
dtypes: int64(1), object(2)
memory usage: 608.0+ bytes

In [53]:
sales.loc['2015-02-19 11:00:00', 'Company']

'Mediacore'

In [54]:
sales.loc['2015-2-5']

                             Company   Product  Units
Date
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10

In [58]:
# Alternative formats:
# ● sales.loc[‘February 5, 2015’]
# ● sales.loc[‘2015-Feb-5’]
# ● Whole month: sales.loc[‘2015-2’]
# ● Whole year: sales.loc[‘2015’]

sales.loc['2015-2']

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10
2015-02-07 23:00:00  Acme Coporation  Hardware      1
2015-02-09 09:00:00        Streeplex   Service     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-19 11:00:00        Mediacore  Hardware     16
2015-02-19 16:00:00        Mediacore   Service     10
2015-02-21 05:00:00        Mediacore  Software      3
2015-02-21 20:30:00            Hooli  Hardware      3
2015-02-25 00:30:00          Initech   Service     10
2015-02-26 09:00:00        Streeplex   Service      4

In [59]:
sales.loc['2015-2-16':'2015-2-20']

                       Company   Product  Units
Date
2015-02-16 12:00:00      Hooli  Software     10
2015-02-19 11:00:00  Mediacore  Hardware     16
2015-02-19 16:00:00  Mediacore   Service     10

In [60]:
# convert string to datetime

evening_2_11 = pd.to_datetime(
    ['2015-2-11 20:00','2015-2-11 21:00', '2015-2-11 22:00', '2015-2-11 23:00']
    )
evening_2_11

DatetimeIndex(['2015-02-11 20:00:00', '2015-02-11 21:00:00',
               '2015-02-11 22:00:00', '2015-02-11 23:00:00'],
              dtype='datetime64[ns]', freq=None)

In [61]:
# reindex

sales.reindex(evening_2_11)

                     Company   Product  Units
2015-02-11 20:00:00  Initech  Software    7.0
2015-02-11 21:00:00      NaN       NaN    NaN
2015-02-11 22:00:00      NaN       NaN    NaN
2015-02-11 23:00:00    Hooli  Software    4.0

In [62]:
sales.reindex(evening_2_11, method='ffill')

                     Company   Product  Units
2015-02-11 20:00:00  Initech  Software      7
2015-02-11 21:00:00  Initech  Software      7
2015-02-11 22:00:00  Initech  Software      7
2015-02-11 23:00:00    Hooli  Software      4

In [63]:
sales

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10
2015-02-07 23:00:00  Acme Coporation  Hardware      1
2015-02-09 09:00:00        Streeplex   Service     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-19 11:00:00        Mediacore  Hardware     16
2015-02-19 16:00:00        Mediacore   Service     10
2015-02-21 05:00:00        Mediacore  Software      3
2015-02-21 20:30:00            Hooli  Hardware      3
2015-02-25 00:30:00          Initech   Service     10
2015-02-26 09:00:00        Streeplex   Service      4

In [64]:
daily_mean = sales.resample('D').mean(numeric_only=True)
daily_mean

            Units
Date
2015-02-02    6.0
2015-02-03   13.0
2015-02-04   13.5
2015-02-05   14.5
2015-02-06    NaN
2015-02-07    1.0
2015-02-08    NaN
2015-02-09   13.0
2015-02-10    NaN
2015-02-11    5.5
2015-02-12    NaN
2015-02-13    NaN
2015-02-14    NaN
2015-02-15    NaN
2015-02-16   10.0
2015-02-17    NaN
2015-02-18    NaN
2015-02-19   13.0
2015-02-20    NaN
2015-02-21    3.0
2015-02-22    NaN
2015-02-23    NaN
2015-02-24    NaN
2015-02-25   10.0
2015-02-26    4.0

In [65]:
print(sales.loc['2015-2-2', 'Units'].mean())

6.0

In [66]:
sales.resample('D').sum(numeric_only=True)

            Units
Date
2015-02-02     12
2015-02-03     13
2015-02-04     27
2015-02-05     29
2015-02-06      0
2015-02-07      1
2015-02-08      0
2015-02-09     26
2015-02-10      0
2015-02-11     11
2015-02-12      0
2015-02-13      0
2015-02-14      0
2015-02-15      0
2015-02-16     10
2015-02-17      0
2015-02-18      0
2015-02-19     26
2015-02-20      0
2015-02-21      6
2015-02-22      0
2015-02-23      0
2015-02-24      0
2015-02-25     10
2015-02-26      4

In [67]:
sales.resample('D').sum(numeric_only=True).max()

Units    29
dtype: int64

In [68]:
sales.resample('W').count()

            Company  Product  Units
Date
2015-02-08        8        8      8
2015-02-15        4        4      4
2015-02-22        5        5      5
2015-03-01        2        2      2

In [ ]:
# Input     Description
# -----------------
# min,T     minute
# H         hour
# D         day
# B         business day
# W         week
# M         month
# Q         quarter
# A         year

In [69]:
sales.loc[:,'Units'].resample('2W').sum()

Date
2015-02-08    82
2015-02-22    79
2015-03-08    14
Freq: 2W-SUN, Name: Units, dtype: int64

In [70]:
two_days = sales.loc['2015-2-4': '2015-2-5', 'Units']
two_days

Date
2015-02-04 15:30:00    13
2015-02-04 22:00:00    14
2015-02-05 02:00:00    19
2015-02-05 22:00:00    10
Name: Units, dtype: int64

In [71]:
two_days.resample('4H').ffill()

Date
2015-02-04 12:00:00     NaN
2015-02-04 16:00:00    13.0
2015-02-04 20:00:00    13.0
2015-02-05 00:00:00    14.0
2015-02-05 04:00:00    19.0
2015-02-05 08:00:00    19.0
2015-02-05 12:00:00    19.0
2015-02-05 16:00:00    19.0
2015-02-05 20:00:00    19.0
Freq: 4H, Name: Units, dtype: float64

In [72]:
# Manipulating time series data
sales = pd.read_csv('dataset/sales-feb-2015.csv', parse_dates=['Date'])
sales.head()

                 Date          Company   Product  Units
0 2015-02-02 08:30:00            Hooli  Software      3
1 2015-02-02 21:00:00        Mediacore  Hardware      9
2 2015-02-03 14:00:00          Initech  Software     13
3 2015-02-04 15:30:00        Streeplex  Software     13
4 2015-02-04 22:00:00  Acme Coporation  Hardware     14

In [73]:
sales['Company'].str.upper()

0               HOOLI
1           MEDIACORE
2             INITECH
3           STREEPLEX
4     ACME COPORATION
5     ACME COPORATION
6               HOOLI
7     ACME COPORATION
8           STREEPLEX
9           MEDIACORE
10            INITECH
11              HOOLI
12              HOOLI
13          MEDIACORE
14          MEDIACORE
15          MEDIACORE
16              HOOLI
17            INITECH
18          STREEPLEX
Name: Company, dtype: object

In [74]:
sales['Product'].str.contains('ware')

0      True
1      True
2      True
3      True
4      True
5      True
6     False
7      True
8     False
9      True
10     True
11     True
12     True
13     True
14    False
15     True
16     True
17    False
18    False
Name: Product, dtype: bool

In [75]:
sales['Product'].str.contains('ware').sum()

14

In [79]:
sales['Date'].dt.hour

0      8
1     21
2     14
3     15
4     22
5      2
6     22
7     23
8      9
9     13
10    20
11    23
12    12
13    11
14    16
15     5
16    20
17     0
18     9
Name: Date, dtype: int64

In [80]:
central = sales['Date'].dt.tz_localize('US/Central')
central

0    2015-02-02 08:30:00-06:00
1    2015-02-02 21:00:00-06:00
2    2015-02-03 14:00:00-06:00
3    2015-02-04 15:30:00-06:00
4    2015-02-04 22:00:00-06:00
5    2015-02-05 02:00:00-06:00
6    2015-02-05 22:00:00-06:00
7    2015-02-07 23:00:00-06:00
8    2015-02-09 09:00:00-06:00
9    2015-02-09 13:00:00-06:00
10   2015-02-11 20:00:00-06:00
11   2015-02-11 23:00:00-06:00
12   2015-02-16 12:00:00-06:00
13   2015-02-19 11:00:00-06:00
14   2015-02-19 16:00:00-06:00
15   2015-02-21 05:00:00-06:00
16   2015-02-21 20:30:00-06:00
17   2015-02-25 00:30:00-06:00
18   2015-02-26 09:00:00-06:00
Name: Date, dtype: datetime64[ns, US/Central]

In [81]:
central.dt.tz_convert('Asia/Kolkata')

0    2015-02-02 20:00:00+05:30
1    2015-02-03 08:30:00+05:30
2    2015-02-04 01:30:00+05:30
3    2015-02-05 03:00:00+05:30
4    2015-02-05 09:30:00+05:30
5    2015-02-05 13:30:00+05:30
6    2015-02-06 09:30:00+05:30
7    2015-02-08 10:30:00+05:30
8    2015-02-09 20:30:00+05:30
9    2015-02-10 00:30:00+05:30
10   2015-02-12 07:30:00+05:30
11   2015-02-12 10:30:00+05:30
12   2015-02-16 23:30:00+05:30
13   2015-02-19 22:30:00+05:30
14   2015-02-20 03:30:00+05:30
15   2015-02-21 16:30:00+05:30
16   2015-02-22 08:00:00+05:30
17   2015-02-25 12:00:00+05:30
18   2015-02-26 20:30:00+05:30
Name: Date, dtype: datetime64[ns, Asia/Kolkata]